/**
 * Created by chenzhaowen on 16-6-17.
 */
HINT_CONFIG = {
    h1:"这个抽屉上了锁",
    h2:"够不着，搬个凳子试一下",
    h3:"需要开机密码!",
    h4:"走的这么匆忙，电话都没放好",
    h5:"这串数字应该是有什么特别用途的，先留着吧",
    h6:"又和记忆中心有关，难怪他会找到我，但是我为什么总觉得来过这里呢？不对，那不是我的记忆！",
    h7:"这里好像少了点什么",
    h8:"恭喜您通过DEMO挑战，该场景还有更多线索等你来发现",
    h9:"屋子里居然有个密室，越来越离奇了，到底该不该进去呢",
    h10:"门开着，屋里没有人，好奇怪，那先四处看看吧",
    h11:"有人在监控这个房子，怎么回事",
    h12:"这个轮盘好像挺特别的，研究看看",
    h13:"有个撕碎的纸团，试试看能不能拼的起来",
    h14:"这里有一部手机，看看有没什么线索",
    h15:"试一试纸条上的数字",
    h16:"4月28脑内开战，好像很不错哦，到时候可以和代晨一起去看！",
    h17:"找到了一个奇特的图案,可能有什么特殊意义!"
};