/**
 * Created by Fizzo on 16/7/8.
 */
var SD_SCENE = {}
SD_SCENE.ID = 0
SD_SCENE.NAME = 1
SD_SCENE.GAMEID = 2
SD_SCENE.GAME_CONFIGURE = 3
SD_SCENE.GAME_FILENAME = 4
SD_SCENE.VALID_RECT = 5
SD_SCENE.LEVEL_SCORE = 6
SD_SCENE.LEVEL_ITEMCOUNT = 7  //--"需要寻找的物品个数"
SD_SCENE.UNLOCK_CONDITION = 8
SD_SCENE.BASEPRIZETYPENAMOUNT1 = 9
SD_SCENE.BASEPRIZETYPENAMOUNT2 = 10
SD_SCENE.NEEDENERGY = 11
SD_SCENE.ITEMFILEID = 12  //--在线索玩法到拼图场景中，同时也是指向拼图之间的相邻数据的索引
SD_SCENE.GAME_TYPE = 13//-- "0`0" 游戏模式`是否倒计时 0倒计时，
SD_SCENE.CLUE_POINTS = 14 //--线索玩法5，中需要寻找的点 "x`y_x`y"
SD_SCENE.ACTION_ITEM = 15  //--场景需要的特殊物品
SD_SCENE.data = [
    [1001, "寝宫", 1, "gameScene_1", "gameScene_1", "0`0`300`200", "400`600`2000`8000`10000", "6`8`10`12`14`16", "", 1000086, 20001, "30`20", 1, "0`1", "", "29"],
    [1002, "寝宫", 7, "gameScene_7", "gameScene7_1", "115`13`900`485", "600`1500`3000`8000`10000", "6`8`10`12`14`16", "", 3000030, 0, "30`20", 1, "0`0", "813`395`1_303`400`1_354`155`1_645`260`1_558`436`0_521`274`0_825`177`0"],
    [1003, "掖庭", 1, "gameScene_2", "gameScene_2", "0`0`100`150", "600`1500`3000`8000`10000", "6`8`10`12`14`16", "", 3100105, 0, "30`20", 2, "1`1", ""],
    [1004, "拼字条", 4, "gameScene_4", "gameScene4_1", "0`0`150`100", "", "", "", 3000030, 0, "30`20", 1, "", ""],
    [1005, "花园", 1, "gameScene_3", "gameScene_3", "0`0`150`100", "600`3000`5000`8000`10000", "6`8`10`12`14`16", "", 3000030, 0, "30`20", 3, "", "", ""],
    [1006, "花园", 3, "gameScene_3", "gameScene_3", "0`0`150`100", "600`3000`5000`8000`10000", "6`8`10`12`14`16", "", 3000030, 0, "30`20", 3, "0`1", ""],
    [1007, "勘验手帕", 6, "gameScene_6", "scratch1", "0`0`150`100", "", "", "", 3000030, 0, "30`20", 1, "", ""],
    [1008, "掖庭", 2, "gameScene_2", "gameScene_2", "0`0`150`100", "300`3000`5000`8000`10000", "3`4`5`6`7`8", "", 3000030, 0, "30`20", 2, "1`1", ""],
    [1009, "寝宫", 8, "gameScene_8", "gameScene_8", "0`0`150`100", "600`1500`3000`8000`10000", "6`8`10`12`14`16", "", 3000030, 0, "30`20", 1, "0`0", "530.21`400.30`2_234.03`511.39`2_117.82`321.84`1_433.78`516.38`2_176.91`176.04`3_439.94`267.28`2"],
]
